[
    {"location": "Mom's Home", "description":"Entering Mom's Home, you feel yourself enveloped in a comforting wave of warmth. You smell the flowery aroma from outside mingling with the sweet scent of confectionary goods. Mom greets you with a soft smile and notices you holding the recipe book that you found earlier. 'Hmmm... You'll need some equipment if you want to make something. I could lend you some of my old tools. Have fun, sweetie.'", "gift": "A baking set"},
    {"location": "The Cozy Cabin","description":"Looking at your recipe book, you skeptically wonder whether or not this is legal. You arrive at the door of The Cozy Cabin, seeing that the door is sealed shut by ice. 'Maybe this place is abandoned...?' you wonder. You sigh and decide to break the small window and climb through, finding a fire on in the hearth and a figure still soundly snoring in a bed situated in the corner. You see a glass jug of milk on a small wooden table in the middle of the room. You note that the table has only one chair. 'What a lonely fellow,' you think to yourself, as you take the jug and climb back out of the window.", "gift": "A jug of milk"},
    {"location": "The Easter Bunny", "description":"You don't find the Easter Bunny, the Easter Bunny found and will always find you. The Easter Bunny hops into view, chasing you down at the speed of an unstopping freight train. As you brace for impact, the bunny screeches to a halt, and takes its paw, sticks it into a large bag it holds, and pulls out a basket of eggs. You look at it, stunned.", "gift": "A basket of eggs"},
    {"location": "The Wooded Peaks", "description":"You hike through the woods, collecting various wildberries from bushes and placing them into a large basket. You note the pleasant chirping of birds and chitter of the chipmunks. As you venture further into the woods, reaching higher altitudes, you notice that a ginger-brown calico cat is following you...how cute! Reaching the summit, you look across the mountain range, amazed by the stiff peaks.", "gift":"A basket of wild berries"},
    {"location": "Windy Fields", "description":"Your eyes pan over fields and fields of tall grasses, dancing in the cool breeze. Few clouds dot the bright blue sky, and you slowly weave through the fields, picking out golden bundles of grain.", "gift": "A bundle of wheat"},
    {"location": "Dragon's Cove", "description":"Following a map you've found of this region, you walk through a lush valley, populated with fluffy sheep and you spot the mouth of a large cavern. Entering the cave, you realize that it is pretty deep and dark...but there's a bright light at the end -- a glorious flame, guarded by a dragon. You mention Gordon Ramsey and the recipe to the sagacious creature, and it grants you a bottle of this flame. Lucky you.", "gift": "The Golden Flame"},
    {"location": "Sunset Hallow", "description":"You reach Sunset Hallow, which is eternally in a beautiful sunset. You whip up the matcha recipe, baking it in the presence of the Golden Flame, and garnishing it with fruits and some honey you've passed by. Just as you are putting on the final touches, a hand grabs your ankle and begins to pull. You fight with the hand, trying to shake it off without dropping the plate of rolls you are holding, but you are eventually pulled under into a black void. You hear the sound of something eating YOUR Matcha Swiss Rolls and black out from stress and despair. You come to, staring at the sky, and its morning now. Sunset Hallow is no longer in sunset! Was a curse broken? You hear a british accent next to you. 'Not bad,' and you turn to see a 60 year old man with blonde hair in a chefs uniform...Gordan Ramsay? Something happened alright. Is it good? You don't know.", "gift":"A VICTORYY!! - oh and the Matcha Swiss Rolls too!"}
]



